export const Gan = ['甲', '乙', '丙', '丁', '戊', '己', '庚', '辛', '壬', '癸'];
export const YangGan = ['甲', '丙', '戊', '庚', '壬'];
export const Zhi = ['子', '丑', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥'];
export const YangZhi = ['子', '寅', '辰', '午', '申', '戌'];
export const YinZhi = ['丑', '卯', '巳', '未', '酉', '亥'];
export const JiShen = ['天乙贵人', '天德', '月德', '学堂', '华盖', '将星', '驿马', '天赦', '福德秀气', '福星贵人'];
export const XiongSha = ['丧门', '吊客', '勾神', '绞神', '孤神', '寡宿', '隔角', '咸池', '伏吟', '反吟', '元辰', '劫杀', '破军', '悬针', '平头', '子暗星', '流霞', '冲天杀', '五鬼杀', '红艳', '吞陷', '三丘五墓', '天罗地网', '太白', '斧劈', '孤虚'];
export const JiShenInterpretation = {
    天乙贵人: {
        sum: '命中逢之还能逢凶化吉，天乙贵人属于吉神，吉则更吉，凶可减凶，命局中带有天乙贵人的特征，还包括聪明、人缘佳、正直开朗，容易得到社会大众的喜爱和支持。',
        nian: '如果天乙贵人在年，同时是用神，而且没有被刑冲克害，那说明天乙贵人能够对自己发挥好的作用，能够得到父母长辈的帮助。一般也代表成长环境不错，包括物质上比较富足，不缺吃穿，也代表在家庭教育方面比较好，能够接收很多正确的三观教育。另外一般也说明家里条件还不错，且能够得到祖荫，能够从父辈那里得到物质支持，继承财富，以及好的思想品德和传统。',
        yue: '如果天乙贵人在月，月柱主要代表命主的事业和人际关系。天乙贵人在月柱出现时，意味着命主在事业和人际关系方面容易得到贵人的帮助。这些贵人可能是同事、合作伙伴或业界前辈等。能给予命主指导和支持，帮助命主。',
        ri: '日支是天乙贵人，一般能够从婚姻中得到好处。日柱自坐天乙贵人并且没有冲克的情况，这个人将会得到贵人的帮助，娶到富贵家庭的富贵之子女为配偶，一生幸福圆满。也说明命主有很强的自我发展和成长的能力，且能够通过个人的努力获得贵人的帮助与支持。',
        shi: '时柱是天乙贵人。时柱逢贵人，一般后代品德不错，有出息，比较孝顺，同时时柱是晚年，也说明晚年不错，晚年有福气，能够安享晚年。'
    },
    天德: {
        sum: '天德贵人为八字神煞之一，是天地德秀之气，逢凶化吉之神，其最大的特点是化解灾厄。命带天德贵人者会遇到很大的福德，其人心地善良，身体健康，人缘好，在生平之中较不会遇到横祸、盗难、灾劫等，纵使逢之也能适时得以化解。古人云：“生日天德最为佳，一生安逸享荣华。免除匪难与神煞贼盗，官刑祸患无有他。',
        nian: '天德贵人在年柱天德贵人在年柱，入命主其人心性善良，忠孝贤能，是先祖行善积德、作善事，余荫遗留给后代子孙的德，其作用可解决各种各样凶煞，逢凶化吉，常常是年老的贵人帮助命主',
        yue: '天德贵人在月柱天德贵人在月柱，命主和他的兄妹都有慈悲心，乐善好施，一生爱帮扶人，广积福德，碰到困难帮助自己的人全是平辈的。',
        ri: '日柱天德贵人天德贵人在日柱，男命有居高一品之职，有一个温柔体贴的媳妇，婚姻生活幸福。女命可嫁美夫，生聪秀贵子，利产无凶，婚姻生活和睦。',
        shi: '天德贵人在时柱天德贵人在时柱，命主世世长年，即后代子孙也会高寿，全是比自个小的贵人帮助自己。'
    },
    月德: {
        sum: '月德贵人属解救之神，意为遇事可免于灾害。命带月德贵人，主人心地善良，能够逢凶化吉，遇难呈祥。功名显达，谨铅光宗耀祖。做事有公德，为人聪明有才气。一生中很少有疾病，而且很少惹官司之灾。《子平赋》云：“印绶得同天德，官刑不至，至老无灾。”',
        nian: '月德贵人在年上，代表祖辈福泽深厚，家里长辈多是厚德之人，先祖行善积德、做善事，余隐遗留给后代子孙的德，其作用可解决各种各样凶煞，逢凶化吉，常常是年长的贵人帮助自己。',
        yue: '月德贵人在月上，主命主和兄弟姐有慈悲心，乐善好施，一生爱帮扶人，广积福德，碰到困难帮助自己的人多是平辈。',
        ri: '月德贵人在日上，主命主婚姻生活和睦。男命利事业名利，女命可嫁美夫，生聪秀贵子，利产无凶，婚姻生活和睦。《鬼谷子》有云：“一德扶持，众凶解释。男逢平步青云，女值福寿俱全。”《三命通会》有云：“女命得之，多为贵人之妻。”',
        shi: '月德贵人在时上，代表一生较少生病，总体上顺利无碍。月德贵人在时柱，预示着命主晚年生活安定祥和。通常子孙有成，晚年生活无忧。八字中有月德星的人，身体康健，一生无大病痛，因此天月二德在日柱是八字中最有利的星宿，预示着命主一生无忧。而且命主往往具有慈悲心肠，乐善好施，一生积德行善，造福子孙后代。'
    },
    学堂: {
        sum: '学堂贵人，是人读书在学堂，所以称为文星，主学业功名。主人秀气生发，聪明智巧，文章冠世，一生富贵。',
        nian: '年柱有学堂，代表长辈有文化，家庭环境好，命主自身聪明，擅长学术研究。',
        yue: '月柱有学堂，代表命主的兄弟姐妹多有才学，聪明伶俐，学业出色。',
        ri: '日柱有学堂，有利于命主升学，也主高升同榜，命主的文采好，文章内容出色',
        shi: '时柱有学堂，代表儿女很好学，知识渊博，有望成为出色的人'
    },
    华盖: {
        sum: '华盖是一颗吉星，命带华盖的人往往具有以下特点：华盖主智慧，命带华盖的人通常头脑聪明，思维敏捷，善于学习和思考。华盖也代表着清高孤傲，命带华盖的人往往不拘小节，不屑于与世俗同流合污。华盖主出世，命带华盖的人往往淡泊名利，追求精神上的自由和解脱。吉者为达官贵人，名道高僧，高级策划参谋，演艺人士，名播四海。否则多为一般僧道术士，或携一技之长浪迹江湖，或沦落为孤寡之人。',
        nian: '年柱代表祖辈，如果华盖在年，则代表祖上有宗教信仰，可能祖上有修行或信仰佛道的人。',
        yue: '月柱代表兄弟姐妹，如果华盖在月，则可能兄弟姐妹之中有人信仰宗教。',
        ri: '如果华盖在日支，则往往代表自己会比较多些，比如自己的性格是那种比较内向孤独型的，喜欢做研究等。',
        shi: '如果华盖在时支，可能是过房之子或入赘孤寡之命。时辰也代表晚年，所以华盖在时支，可能命主在晚年会选择修行。'
    },
    将星: {
        sum: '将星为吉星，命中出现将星的人，有掌权居官之能，所谓“将星文武两相宜，禄重权高足可知”。惟命局中有官杀星或印星有力者方眞。透干尤佳，如四柱中无财星及官杀星者，不能入格。身强为福，身弱者权贵无。将星所临之支是正官为喜神，又不逢冲破的，此人在政治界易有辉煌成就。如果命局中和定能掌权，地位显达。将星所临地支是七杀或阳刃的，则此人必掌有别人的生死大权。如果将星所临之地支是 日干之财星为喜神的话，则常是掌握财政大权之官员。若与凶星会合，则增凶星之气，如命忌劫财，将星临之，其害倍增。',
        nian: '年柱带将星，代表从小就有很大的领导才能，或是父母身居高位。命主从小就能表现出领导才能，在学校就能当个班长或者班委之类的。',
        yue: '将星在月柱，命主的管理能力在青年时期才开始显现，一般青年时候才能体现出来。',
        ri: '将星在日柱，命主做事有领袖风范，本身具备领导能力。',
        shi: '4、将星在时柱，命主的管理能力和控制欲望强，表示日主具备领导能力和控制欲望，这种情况在晚年最盛，对子女也有很大的控制欲。'
    },
    驿马: {
        sum: '驿马，在古代驿马为传递文书的交通工具，所以驿马通常是代表走动。八字中有多个驿马，则主心意不定，见异思迁，一生不安，东奔西走，飘泊无定，万分辛劳。诗云：八字驿马纷交驰，身荣劳碌在东西，倘有身闲心不定，动则风流静则悲。八字中驿马受冲，比如申为驿马，又有寅字，寅申相冲，一生动得最为厉害。小孩八字有驿马逢冲，可能有小儿多动症。经云：马后加鞭，朝乎北而墓乎南。女命不喜八字有驿马，更不喜驿马逢冲，如果有了二个或二个以上的驿马，或者驿马逢冲，乃不吉之兆，一生操劳，社交活动多，在外奔波多，心意不定，并有可能红杏出墙。',
        nian: '驿马在年柱，祖父母有迁移或搬家，还是父亲常外出或到他乡工作或许早年易搬家或出外来学。因年柱离日主较远，对命主影响较小。为喜则有祖业可得，但比较少。为忌则劳碌在童年搬家。',
        yue: '驿马在月柱，一生易有三次大变动，父母、兄弟姐妹有生离〈如果冲击太过，则有死别之象）轻则生离，重则死别。月柱为提纲，驿马在此，容易出外或搬家、换工作。为喜则身在他乡，跟家中尚有连络，为忌则像断了线的风筝或客留他乡。',
        ri: '驿马在日支，配偶为外乡人或要常外出工作、不常在家或人在家中，心却在他处，如男坐七杀、女坐偏财易有此象。为喜则配偶虽有暂时分离，感情不变。为忌则易生离死别。',
        shi: '驿马在时柱，子女易外出不在身边，或是晚年还外出。为喜则出外旅游或移居，为忌则劳碌之命，晚年为三餐温饱而奔波。'
    },
    天赦: {
        sum: '天赦星是吉星，命中若逢天赦，一生处世无忧，犹如皇帝大赦天下，表示天下太平，命中有犯刑的人，遇此能减灾免刑。古歌云：“命遇天赦不用愁，逢凶不凶得自由，冉遇吉星来相助，一生快乐永无忧。”如果命带“天赦”主逢凶化吉，若日元得旺，配合得宜，多为大人物极品之贵。《三车一览》也说，“命中若逢天觳，一生处事无忧”。'
    },
    福德秀气: {
        sum: '福德秀气，己丑日主，生临地支巳酉丑全者，为福德。要天干三个乙字，地支巳酉丑全者，为秀气。代表聪明伶俐，有贵人的潜质。'
    },
    福星贵人: {
        sum: '福星贵人，一般命带福星贵人主其人多安多寿，平安福气，所以多主福气、平安，但不主富贵。配合上佳格局，更能一生荣显。《三车一览赋》云：福星贵人众所钦，命中最喜值此神。',
        nian: '福星贵人在年柱，则形貌丰富、有福相，不喜杂术，纯粹大器，身殖道德，众人钦爱，性灵颖悟，理义分明，死绝则执拗自是，喜游近责。',
        yue: '月柱有福星贵人，喜欢无拘无束、生活自由自在、充满新奇与变化；一般日常生活喜欢旅行、阅读、看电影、梦想与幻想，浪漫而充满爱心。优点是崇尚自由，拥有丰富的想象力，对人大方，感情丰富。缺点是生活不安定，需要不断寻找新鲜的事物，无法享受悠闲。',
        ri: '日柱福星贵人，八字遇此主一辈子衣食无缺，如配合恰当，必主多福多寿，金玉满堂，常人遇之，主三餐温饱，无忧无愁。',
        shi: '时柱福星贵人,八字时柱中有福星贵人，主一辈子福禄无缺，格局配合恰当，必然多福多寿，金玉满堂。'
    },
    红鸾: {
        sum: '一般主有婚庆喜事，红鸾星。在命，代表婚姻早发，命中没有红鸾，代表此人在感情方面，态度倾向于理性、踏实。命有遇红鸾，性格温柔，注重外表，耿直端正，光明磊落。在外表上美丽秀气，魁力十足。男命若带红鸾，身材高大，可得女士的帮助与喜欢，有的人还可以得到妻财，娶个好老婆。女命带红鸾，美丽秀气，急性，有趣，命若是吉命可嫁好丈夫。'
    },
    天喜: {
        sum: '在八字中代表吉祥、喜庆和好运。天喜是八字命理学中的一颗神煞，其含义深远且丰富。它主要关联着男女情感之喜以及喜庆吉顺的事情，被视为婚姻喜庆的吉兆。当天喜星入命时，往往预示着命主在婚姻、爱情等方面能够遇到喜事，如缔结良缘、夫妻和谐等。此外，天喜还具备消灾避凶的能力，可以化凶为吉，为命主带来安宁和好运。在性格方面，天喜星入命的人通常性格活泼奔放、主动积极，善于交际且人缘颇佳。除了上述意义，天喜还代表着财富和吉祥。命理学认为，天喜能够给命主带来好运和富足的生活，特别是在结婚生子后，命主的财运往往更加旺盛。此外，天喜还常被提及为桃花运的提升，它能让命主的恋情更加顺利，增加遇到理想伴侣的机会，并促进情感的稳定发展。总的来说，天喜在八字中是一个充满喜庆、好运和吉祥的神煞。'
    }
};
export const XiongShaInterpretation = {
    空亡: {
        sum: '空亡，是以六甲为旬首论空亡，空亡多有不实，多主该宫位有欠缺，若格局见凶神恶煞见空亡煞反而利，则有煞不攻身反为福报，最忌贵人、吉曜陷空亡煞，则贵气大减，不能论吉也。',
        nian: '代表命主祖上无荫，父母健康受损害，严重的甚至于阳寿有损，无父母的协助，或是父母的协助很小，或是自幼与父母缘份浅。由于年柱指的是人生1-16岁，故16岁之前阻力重重，困境难过。',
        yue: '代表命主与兄弟姐妹缘份浅薄，不得其助，严重的与兄弟姐妹势同水火，也少于得到同事、朋友的协助。由于月柱指人生16-32岁，因此年龄段内事业，家庭等各个方面不顺遂。',
        ri: '代表命主与配偶关系冷淡，夫妻感情不和，配偶无助力或者少助力，难有难以忘怀的爱情可言。由于日柱指人生32-48岁，因此年龄段内家事不兴，波折不定。',
        shi: '代表不能得到子女的照顾，子女不得力，甚至于子女有多病或是夭折的可能，并且48岁以后健康方面不隹，晚年不吉。'
    },
    丧门: {
        sum: '在命理中，逢丧门星临门大主不吉，故流年逢此凶星，须要多加小心。命犯丧门之人，预示着一生容易遭遇天降横祸，正如十二主星宿中记载：“丧门原是扫帚星，风吹草动心惶惊，人坐家中祸天落，出门在外防贼兵。”',
        nian: '年柱上有丧门，代表刑克自己1-16岁的运势和父母，祖业凋零或者父母身体不好，自己的早年运势不是很好。',
        yue: '月柱上有丧门，指本人17~32岁青年运期间，家中或者亲人易有问题，家庭容易失和或者出现危机。',
        ri: '日柱上有丧门，33~48岁中年运，可能出出现事业运下滑，容易破财，或者家庭有危机。',
        shi: '时柱上有丧门，也就是自己晚年的时候，有可能为子女之事而烦忧，或者自己的身体出现伤病。'
    },
    吊客: {
        sum: '八字中吊客代表孝丧之事，若是大运、流年逢之，加上八字组合比较不好的话，代表命主往往会发生一些霉运；八字中出现丧门、吊客的命局，表示命主有不利六亲的命格。《三命消息赋》云：“丧吊临人，变宫商为薤露。”在八字的年柱、月柱带吊客的命主，一般会在三十五岁之前刑伤父母、祖上；在日柱和时柱上出现了吊客的命主，会在三十五岁后对六亲和兄弟造成威胁和刑克。',
        nian: '在八字的年柱、月柱带吊客的命主，一般会在三十五岁之前刑伤父母、祖上；',
        yue: '在八字的年柱、月柱带吊客的命主，一般会在三十五岁之前刑伤父母、祖上；',
        ri: '在日柱和时柱上出现了吊客的命主，会在三十五岁后对六亲和兄弟造成威胁和刑克。',
        shi: '在日柱和时柱上出现了吊客的命主，会在三十五岁后对六亲和兄弟造成威胁和刑克。'
    },
    勾神: {
        sum: '在八字命理学中，勾神代表牵连、羁绊的意思，通常与刑法、飞灾横祸、官讼、破财等不利事件相关',
        nian: '主为人性格阴沉狡诈，心机深沉，善于伪装，容易与人交恶。勾神在年柱，主早年运势不佳，多有小人作祟，事业难成，需小心防范。',
        yue: '勾神在月柱，主情感坎坷，容易发生三角恋或婚外情，夫妻关系不和谐，易生口舌之争。主身体状况不佳，易患慢性疾病或精神疾病，需多注意保养。',
        ri: '勾神在日柱，主婚姻不顺，容易遇到烂咸池或渣男渣女，婚姻生活波折不断。勾神在日柱，主事业不稳定，容易遇到小人陷害或暗中掣肘，财运亦不佳。',
        shi: '勾神在时柱主晚年运势不佳，与子女缘分较浅，容易发生隔阂或矛盾。勾神在时柱，主身体状况较差，晚年易患老年疾病，需注意养生保健康。'
    },
    孤神: {
        sum: '八字中，孤神通常被认为是一种不吉利的神煞，预示着命主可能会经历孤独或疏离。具体来说，男命带孤神者可能会疏离六亲，而女命遇寡宿则可能独宿孤眠，两者都象征着孤独落寞的生活。'
    },
    寡宿: {
        sum: '在八字命理中，寡宿的出现往往预示着一个人的命运中可能会遇到孤独、寂寞、感情不顺等问题。男命为人孤僻；女命为人孤独，老年孤单寂寥。寡宿星主孤寡，通常喜欢胡思乱想，个性郁闷，消极悲观，让人不悦。女命忌寡宿星。年老无夫为寡逢天乙可解其凶。',
        nian: '寡宿在年月柱，代表和六亲缘份淡薄，为独立自成之命',
        yue: '寡宿在年月柱，代表和六亲缘份淡薄，为独立自成之命',
        ri: '寡宿在日柱，代表夫妻男女缘份淡薄',
        shi: '寡宿在时柱，代表与子孙缘份淡薄'
    },
    隔角: {
        sum: '古书有云：“隔角相逢犯岁君，官灾牢狱祸无穷，口舌风波与刑讼，仅防闲非入牢中。”凡八字逢隔角煞者，命主六亲缘薄，做事或出外易遭遇困难、阻碍、隔绝等情况，也容易犯口舌、是非，易与人发生纠纷，若再逢刑冲，必有官非诉讼、牢狱之灾。'
    },
    咸池: {
        sum: '咸池又叫桃花，是一颗与酒色财气、男欢女爱相关连的星神，还代表魅力、吸引力、异性缘、社交人缘、鉴赏审美能力等。咸池入命，若命局配合不当，则耽溺酒色、性好淫逸、疏懒嗜赌，须防情事风波。若命局配合得当，咸池与贵人同柱，又为日主之喜用，反成吉祥之物。主人形貌清灵端秀，言语爽朗动听，性巧多才艺，一生人缘甚佳。即便妇女带之，亦主善持家待客，有助夫之能，不可一概视为凶物。女命若时支带咸池，时干不宜再见伤官，因为伤官本身已伤害官星（即夫星），如再坐咸池，将导致婚姻不美满。唯若有一位正官坐于其上者，不以凶论，即有丈夫把守，别人不易抢夺。',
        nian: '墙内咸池：出现在年、月支上的咸池为是。主夫妻恩爱合谐。但墙内咸池怕柱上有冲，冲则门开墙破，不免拈花惹草，风流多情。',
        yue: '墙内咸池：出现在年、月支上的咸池为是。主夫妻恩爱合谐。但墙内咸池怕柱上有冲，冲则门开墙破，不免拈花惹草，风流多情。',
        ri: '日时两柱管中、晚年之大限，此时年纪已大，儿孙成群，自不宜再发生感情事件，而贻笑子孙。故日时两柱之咸池较不宜。',
        shi: '日时两柱管中、晚年之大限，此时年纪已大，儿孙成群，自不宜再发生感情事件，而贻笑子孙。故日时两柱之咸池较不宜。'
    },
    流霞: {
        sum: '男犯流霞刀枪死，女犯流霞产红亡，犯此煞者，男子容易有流血事件，女子怀孕困难，就算怀上也容易动胎流产。'
    },
    元辰: {
        sum: '元辰，犯此煞者，若为男子，则会有别人看不起的事情;若为女子，则病痛缠身。'
    },
    劫煞: {
        sum: '犯此煞者，妻子儿女多灾多难，家财外流，工作不顺。'
    },
    绞神: {
        sum: '相传，犯此煞者，常年疾病缠身，体弱多梦，心情抑郁，又说，犯此煞者，感情、婚缘麻烦，尤其是现于日柱，婚事多麻烦。'
    }
};
export const GanZhiMap = {
    甲: 'Mu',
    乙: 'Mu',
    寅: 'Mu',
    卯: 'Mu',
    丙: 'Huo',
    丁: 'Huo',
    巳: 'Huo',
    午: 'Huo',
    戊: 'Tu',
    己: 'Tu',
    辰: 'Tu',
    戌: 'Tu',
    丑: 'Tu',
    未: 'Tu',
    庚: 'Jin',
    辛: 'Jin',
    申: 'Jin',
    酉: 'Jin',
    壬: 'Shui',
    癸: 'Shui',
    亥: 'Shui',
    子: 'Shui'
};
// 天乙贵人
const tianyiguiren = {
    甲: ['丑', '未'],
    戊: ['丑', '未'],
    乙: ['子', '申'],
    己: ['子', '申'],
    丙: ['亥', '酉'],
    丁: ['亥', '酉'],
    壬: ['卯', '巳'],
    癸: ['卯', '巳'],
    庚: ['午', '寅'],
    辛: ['午', '寅']
};
// 天德
const tiande = {
    寅: ['丁'],
    卯: ['申'],
    辰: ['壬'],
    巳: ['辛'],
    午: ['亥'],
    未: ['甲'],
    申: ['癸'],
    酉: ['寅'],
    戌: ['丙'],
    亥: ['乙'],
    子: ['子'],
    丑: ['庚']
};
// 月德
const yuede = {
    寅: ['丙'],
    卯: ['甲'],
    辰: ['壬'],
    巳: ['庚'],
    午: ['丙'],
    未: ['甲'],
    申: ['壬'],
    酉: ['庚'],
    戌: ['丙'],
    亥: ['甲'],
    子: ['壬'],
    丑: ['庚']
};
// 学堂
const xuetang = {
    甲: ['亥'],
    乙: ['午'],
    丙: ['寅'],
    丁: ['酉'],
    戊: ['寅'],
    己: ['酉'],
    庚: ['巳'],
    辛: ['子'],
    壬: ['申'],
    癸: ['卯']
};
// 华盖
const huagai = {
    寅: ['戌'],
    午: ['戌'],
    戌: ['戌'],
    亥: ['未'],
    卯: ['未'],
    未: ['未'],
    申: ['辰'],
    子: ['辰'],
    辰: ['辰'],
    巳: ['丑'],
    酉: ['丑'],
    丑: ['丑']
};
// 将星
const jiangxing = {
    寅: ['午'],
    午: ['午'],
    戌: ['午'],
    亥: ['卯'],
    卯: ['卯'],
    未: ['卯'],
    申: ['子'],
    子: ['子'],
    辰: ['子'],
    巳: ['酉'],
    酉: ['酉'],
    丑: ['酉']
};
// 驿马
const yima = {
    寅: ['申'],
    午: ['申'],
    戌: ['申'],
    亥: ['巳'],
    卯: ['巳'],
    未: ['巳'],
    申: ['寅'],
    子: ['寅'],
    辰: ['寅'],
    巳: ['亥'],
    酉: ['亥'],
    丑: ['亥']
};
// 丧门
const sangmen = {
    寅: ['辰'],
    卯: ['巳'],
    辰: ['午'],
    巳: ['未'],
    午: ['申'],
    未: ['酉'],
    申: ['戌'],
    酉: ['亥'],
    戌: ['子'],
    亥: ['丑'],
    子: ['寅'],
    丑: ['卯']
};
// 吊客
const diaoke = {
    寅: ['子'],
    卯: ['丑'],
    辰: ['寅'],
    巳: ['卯'],
    午: ['辰'],
    未: ['巳'],
    申: ['午'],
    酉: ['未'],
    戌: ['申'],
    亥: ['酉'],
    子: ['戌'],
    丑: ['亥']
};
// 勾神
// 阳男阴女
const goushenyang = {
    寅: ['巳'],
    卯: ['午'],
    辰: ['未'],
    巳: ['申'],
    午: ['酉'],
    未: ['戌'],
    申: ['亥'],
    酉: ['子'],
    戌: ['丑'],
    亥: ['寅'],
    子: ['卯'],
    丑: ['辰']
};
// 阴男阳女
const goushenyin = {
    寅: ['亥'],
    卯: ['子'],
    辰: ['丑'],
    巳: ['寅'],
    午: ['卯'],
    未: ['辰'],
    申: ['巳'],
    酉: ['午'],
    戌: ['未'],
    亥: ['申'],
    子: ['酉'],
    丑: ['戌']
};
// 阳男阴女
const jiaoshenyang = {
    寅: ['亥'],
    卯: ['子'],
    辰: ['丑'],
    巳: ['寅'],
    午: ['卯'],
    未: ['辰'],
    申: ['巳'],
    酉: ['午'],
    戌: ['未'],
    亥: ['申'],
    子: ['酉'],
    丑: ['戌']
};
// 阴男阳女
const jiaoshenyin = {
    寅: ['巳'],
    卯: ['午'],
    辰: ['未'],
    巳: ['申'],
    午: ['酉'],
    未: ['戌'],
    申: ['亥'],
    酉: ['子'],
    戌: ['丑'],
    亥: ['寅'],
    子: ['卯'],
    丑: ['辰']
};
// 孤神
const gushen = {
    寅: ['巳'],
    卯: ['巳'],
    辰: ['巳'],
    巳: ['申'],
    午: ['申'],
    未: ['申'],
    申: ['亥'],
    酉: ['亥'],
    戌: ['亥'],
    亥: ['寅'],
    子: ['寅'],
    丑: ['寅']
};
// 寡宿
const guaxiu = {
    寅: ['丑'],
    卯: ['丑'],
    辰: ['丑'],
    巳: ['辰'],
    午: ['辰'],
    未: ['辰'],
    申: ['未'],
    酉: ['未'],
    戌: ['未'],
    亥: ['戌'],
    子: ['戌'],
    丑: ['戌']
};
// 咸池
const xianchi = {
    寅: ['卯'],
    午: ['卯'],
    戌: ['卯'],
    亥: ['巳'],
    卯: ['巳'],
    未: ['巳'],
    申: ['酉'],
    子: ['酉'],
    辰: ['酉'],
    巳: ['午'],
    酉: ['午'],
    丑: ['午']
};
// 元辰
const yuanchenyang = {
    寅: ['酉'],
    卯: ['戌'],
    辰: ['亥'],
    巳: ['子'],
    午: ['丑'],
    未: ['寅'],
    申: ['卯'],
    酉: ['辰'],
    戌: ['巳'],
    亥: ['午'],
    子: ['未'],
    丑: ['申']
};
const yuanchenyin = {
    寅: ['未'],
    卯: ['申'],
    辰: ['酉'],
    巳: ['戌'],
    午: ['亥'],
    未: ['子'],
    申: ['丑'],
    酉: ['寅'],
    戌: ['卯'],
    亥: ['辰'],
    子: ['巳'],
    丑: ['午']
};
// 劫杀
const jiesha = {
    寅: ['亥'],
    午: ['亥'],
    戌: ['亥'],
    亥: ['申'],
    卯: ['申'],
    未: ['申'],
    申: ['巳'],
    子: ['巳'],
    辰: ['巳'],
    巳: ['寅'],
    酉: ['寅'],
    丑: ['寅']
};
// 破军
const pojun = {
    寅: ['巳'],
    午: ['巳'],
    戌: ['巳'],
    亥: ['寅'],
    卯: ['寅'],
    未: ['寅'],
    申: ['亥'],
    子: ['亥'],
    辰: ['亥'],
    巳: ['申'],
    酉: ['申'],
    丑: ['申']
};
const zianxing = {};
// 流霞
const liuxia = {
    甲: ['酉'],
    戊: ['巳'],
    乙: ['戌'],
    己: ['午'],
    丙: ['未'],
    丁: ['申'],
    壬: ['亥'],
    癸: ['寅'],
    庚: ['辰'],
    辛: ['卯']
};
// 红艳
const hongyan = {
    甲: ['午'],
    戊: ['辰'],
    乙: ['申'],
    己: ['辰'],
    丙: ['寅'],
    丁: ['未'],
    壬: ['子'],
    癸: ['申'],
    庚: ['戌'],
    辛: ['酉']
};
// 吞陷
const tunxia = {};
// 三丘五墓
const sanqiuwumu = {};
// 天罗地网
const tianluodiwang = {};
// 太白
const taibai = {};
// 斧劈
const fupi = {};
// 孤虚
const guxu = {};
const wuguisha = {};
const tianshe = {};
const fudexiuqi = {};
const fuxingguiren = {};

export const JiShenTrans = {tianyiguiren, tiande, yuede, xuetang, huagai, jiangxing, yima, tianshe, fudexiuqi, fuxingguiren};
export const XiongShaTrans = {sangmen, diaoke, goushenyang, goushenyin, jiaoshenyang, jiaoshenyin, gushen, guaxiu, xianchi, yuanchenyang, yuanchenyin, jiesha, pojun, zianxing, liuxia, wuguisha, hongyan, tunxia, sanqiuwumu, tianluodiwang, taibai, fupi, guxu};
// 十神简称
export const simShishen = {
    比肩: '比',
    劫财: '劫',
    食神: '食',
    伤官: '伤',
    偏财: '才',
    正财: '财',
    七杀: '杀',
    正官: '官',
    偏印: '枭',
    正印: '印'
};
